Revit 2027 API
BrowserOrganization.GetFolderItems Method
 Returns a collection of leaf FolderItemInfo objects each containing the given element Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FolderItemInfo> GetFolderItems(
	ElementId elementId
)
Public Function GetFolderItems (
	elementId As ElementId
) As IList(Of FolderItemInfo)
public:
IList<FolderItemInfo^>^ GetFolderItems(
	ElementId^ elementId
)
member GetFolderItems :
        elementId : ElementId -> IList<FolderItemInfo>
Parameters
elementId ElementId
 Element id located at a leaf position in the project browser.
Return Value
IList<FolderItemInfo>
 An array of FolderItemInfo objects.
Exceptions
Exception | Condition
ArgumentException |  elementId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
Remarks
 Each returned FolderItemInfo includes the folder name and the corresponding folder parameter Id.
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace